//UUMNUFE1 JOB
//*
//CICSPROC JCLLIB ORDER=(KC03FE1.DCMAFD02.A4.MNU.PROCLIB)
//*
//*********************************************************************
//*           TRANSLATE COMPILE
//*           AND LINK A CICS COBOL PROGRAM
//*********************************************************************
//COMPLI   EXEC DFHZITCL,
//* NAME OF PROGRAM AND ALSO NAME OF MEMBER WITHIN STUDLIB
//*      MEMBER='UUMNUFE1'
//             PROGLIB=TSOECCC.CICSTS12.STUDENT.LOADLIB,
//             PROGSRC=KC03FE1.DCMAFD02.A4.MNU.COBOL,
//             PROGMBR=UUMNUFE1,
//             CPYLIBWS=KC03FE1.DCMAFD02.COPYBOOK.WS.COBOL,
//             CPYLIBPR=KC03FE1.DCMAFD02.COPYBOOK.PR.COBOL
//* NAME OF PROGRAM AND MEMBER TO TRANSLATE/COMPILE/LKED
//COBOL.SYSIN DD DSN=&PROGSRC(&PROGMBR),DISP=SHR
/*
