//KC03FE1A JOB
/*
/* DELETE OUTPUT FILE IF IT EXISTS
/*
//DELETE   EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLMA,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* EXECUTE REPLMA PROGRAM (ALB/MAN REPLACEMENTS)
/*
//REPLMA   EXEC PGM=REPLMA
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLMA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
