//KC03FE1A JOB
/*
/* DELETE OUTPUT FILES IF THEY EXIST
/*
//DELETE   EXEC PGM=IEFBR14
//REPFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPAIR,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPLOQFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLOQ,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPLMAFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.CONTROL,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* EXECUTE SPLITT PROGRAM
/*
//SPLITT    EXEC PGM=SPLITT
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=SHR
//REPFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPAIR,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPLOQFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLOQ,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPLMAFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.CONTROL,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
