//KC03FE1 JOB
//COBOL    EXEC PROC=IGYWCL,
//    PARM.COBOL='TEST,RENT,APOST,OBJECT,NODYNAM,LIB'
//COBOL.SYSIN DD DSN=KC03FE1.DCMAFD02.A3.COBOL(EDIT),
//    DISP=SHR
//LKED.SYSLMOD DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB(EDIT),
//    DISP=OLD
/*
