//KC03FE1A JOB
/*
/* DELETE OUTPUT FILES IF THEY EXIST
/*
//DELETE   EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.ERRORS,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//VALFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//INVFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.INVALID,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* EXECUTE EDIT PROGRAM
/*
//EDIT     EXEC PGM=EDIT
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.INSUR2,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.ERRORS,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=100
//VALFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//INVFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.INVALID,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
/*
