//KC03FE1A JOB
/*
/* SYSTEM JCL TO RUN ALL FIVE PROGRAMS
/*
/* STEP 1: DELETE ALL OUTPUT FILES FROM PREVIOUS RUNS
/*
//DELETE1  EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.ERRORS,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//VALFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//INVFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.INVALID,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* STEP 2: EXECUTE EDIT PROGRAM
/*
//EDIT     EXEC PGM=EDIT
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.INSUR2,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.ERRORS,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=100
//VALFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//INVFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.INVALID,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
/*
/* STEP 3: DELETE SPLITT OUTPUT FILES
/*
//DELETE2  EXEC PGM=IEFBR14
//REPFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPAIR,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPLOQFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLOQ,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPLMAFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
//RPTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.CONTROL,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* STEP 4: EXECUTE SPLITT PROGRAM
/*
//SPLITT    EXEC PGM=SPLITT
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.VALID,
//    DISP=SHR
//REPFILE  DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPAIR,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPLOQFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLOQ,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPLMAFIL DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=76
//RPTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.CONTROL,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
/* STEP 5: DELETE REPAIR OUTPUT FILE
/*
//DELETE3  EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPAIR,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* STEP 6: EXECUTE REPAIR PROGRAM
/*
//REPAIR   EXEC PGM=REPAIR
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPAIR,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPAIR,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
/* STEP 7: DELETE REPLOQ OUTPUT FILE
/*
//DELETE4  EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLOQ,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* STEP 8: EXECUTE REPLOQ PROGRAM (ONT/QUE REPLACEMENTS)
/*
//REPLOQ   EXEC PGM=REPLOQ
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLOQ,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLOQ,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
/* STEP 9: DELETE REPLMA OUTPUT FILE
/*
//DELETE5  EXEC PGM=IEFBR14
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLMA,
//    DISP=(MOD,DELETE,DELETE),
//    SPACE=(TRK,0)
/*
/* STEP 10: EXECUTE REPLMA PROGRAM (ALB/MAN REPLACEMENTS)
/*
//REPLMA   EXEC PGM=REPLMA
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.A3.LOADLIB,
//    DISP=SHR
//INFILE   DD DSN=KC03FE1.DCMAFD02.A3.DATA.REPLMA,
//    DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A3.REPORT.REPLMA,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(5,2)),
//    RECFM=F,
//    LRECL=133
/*
