//UUMENYYY JOB
//*
//CICSPROC JCLLIB ORDER=(KC03YYY.DCMAFD02.A4.MENU.PROCLIB)
//*
//*********************************************************************
//*           TRANSLATE COMPILE
//*           AND LINK A CICS COBOL PROGRAM
//*********************************************************************
//COMPLI   EXEC DFHZITCL,
//* NAME OF PROGRAM AND ALSO NAME OF MEMBER WITHIN STUDLIB
//*      MEMBER='UUMENYYY'
//             PROGLIB=TSOECCC.CICSTS12.STUDENT.LOADLIB,
//             PROGSRC=KC03YYY.DCMAFD02.A4.MENU.COBOL,
//             PROGMBR=UUMNUYYY,
//             CPYLIBWS=KC03YYY.DCMAFD02.COPYBOOK.WS.COBOL,
//             CPYLIBPR=KC03YYY.DCMAFD02.COPYBOOK.PR.COBOL
//* NAME OF PROGRAM AND MEMBER TO TRANSLATE/COMPILE/LKED
//COBOL.SYSIN DD DSN=&PROGSRC(&PROGMBR),DISP=SHR
/*