//CMFLCYYY JOB
/* LIST CATALOG INFORMATION FOR VSAM
//LISTCAT  EXEC  PGM=IDCAMS
//SYSPRINT DD    SYSOUT=A
//SYSIN    DD    *
     LISTCAT -
           ENTRIES(KC03YYY.DCMAFD02.A5P1.CICS.CMFYYY) -
           CLUSTER -
           ALL
/*