//CMFCCFE1  JOB
/*
/* FIX NAME, DATA NAME, AND INDEX NAME TO MATCH NAMING CONVENTIONS
/* FIX KEYS, AND RECSZ TO MATCH RECORD LAYOUT REQUIRED
/* FIX YYY TO MATCH YOUR USERID KC03FE1
/*
//DEFCLST EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DELETE KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1 CLUSTER
   DEFINE CLUSTER ( -
   NAME(KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1)  -
   INDEXED                                 -
   KEYS(6 0)                             -
   RECSZ(118 118)                            -
   TRACKS(1,1)                             -
   CISZ(4096)                              -
   FREESPACE(3 3) )                        -
   DATA (NAME(KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1.DATA))      -
   INDEX (NAME(KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1.INDEX))
/*