//CMFLOFE1         JOB
/* COMPILE/LKED VSAM DATA LOAD PROGRAM
//COBOL            EXEC PROC=IGYWCL,
//    PARM.COBOL='TEST,RENT,APOST,OBJECT,NODYNAM,LIB,SIZE(2097152)'
//COBOL.SYSLIB  DD DSN=KC03FE1.DCMAFD02.A5P1.COBOL,DISP=SHR
/* DECLARE DATASET THAT CONTAINS SOURCE CODE
//COBOL.SYSIN DD DSN=KC03FE1.DCMAFD02.A5P1.COBOL(CMFLOFE1),DISP=SHR
/*
/* DECLARE PDS MEMBER TO STORE LOAD MODULE
//LKED.SYSLMOD DD DSN=KC03FE1.DCMAFD02.COBOL.LOADLIB(CMFLOFE1),
//    DISP=OLD
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//CMFLOAD  EXEC PGM=CMFLOFE1
/*
//STEPLIB  DD DSN=KC03FE1.DCMAFD02.COBOL.LOADLIB,DISP=SHR
//CMFDATA  DD DSN=KC03FE1.DCMAFD02.A5P1.CMF.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1,DISP=SHR
/*