//CMFLCFE1 JOB
/* LIST CATALOG INFORMATION FOR VSAM
//LISTCAT  EXEC  PGM=IDCAMS
//SYSPRINT DD    SYSOUT=A
//SYSIN    DD    *
     LISTCAT -
           ENTRIES(KC03FE1.DCMAFD02.A5P1.CICS.CMFFE1) -
           CLUSTER -
           ALL
/*